MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsaml21/thirdparty/atsaml21/component/mclk.h
#define MCLK_APBCMASK_SERCOM_Pos              _U_(0)                                               /**< (MCLK_APBCMASK Position) SERCOMx APB Clock Enable */
#define MCLK_APBCMASK_SERCOM_Msk              (_U_(0x1F) << MCLK_APBCMASK_SERCOM_Pos)              /**< (MCLK_APBCMASK Mask) SERCOM */
#define MCLK_APBCMASK_SERCOM(value)           (MCLK_APBCMASK_SERCOM_Msk & ((value) << MCLK_APBCMASK_SERCOM_Pos)) 
#define MCLK_APBCMASK_TCC_Pos                 _U_(5)                                               /**< (MCLK_APBCMASK Position) TCCx APB Clock Enable */
#define MCLK_APBCMASK_TCC_Msk                 (_U_(0x7) << MCLK_APBCMASK_TCC_Pos)                  /**< (MCLK_APBCMASK Mask) TCC */
#define MCLK_APBCMASK_TCC(value)              (MCLK_APBCMASK_TCC_Msk & ((value) << MCLK_APBCMASK_TCC_Pos)) 
#define MCLK_APBCMASK_TC_Pos                  _U_(8)                                               /**< (MCLK_APBCMASK Position) TCx APB Clock Enable */
#define MCLK_APBCMASK_TC_Msk                  (_U_(0xF) << MCLK_APBCMASK_TC_Pos)                   /**< (MCLK_APBCMASK Mask) TC */
#define MCLK_APBCMASK_TC(value)               (MCLK_APBCMASK_TC_Msk & ((value) << MCLK_APBCMASK_TC_Pos)) 

/* -------- MCLK_APBDMASK : (MCLK Offset: 0x20) (R/W 32) APBD Mask -------- */
#define MCLK_APBDMASK_RESETVALUE              _U_(0xFF)                                            /**<  (MCLK_APBDMASK) APBD Mask  Reset Value */

#define MCLK_APBDMASK_EVSYS_Pos               _U_(0)                                               /**< (MCLK_APBDMASK) EVSYS APB Clock Enable Position */
#define MCLK_APBDMASK_EVSYS_Msk               (_U_(0x1) << MCLK_APBDMASK_EVSYS_Pos)                /**< (MCLK_APBDMASK) EVSYS APB Clock Enable Mask */
#define MCLK_APBDMASK_EVSYS(value)            (MCLK_APBDMASK_EVSYS_Msk & ((value) << MCLK_APBDMASK_EVSYS_Pos))
#define MCLK_APBDMASK_SERCOM5_Pos             _U_(1)                                               /**< (MCLK_APBDMASK) SERCOM5 APB Clock Enable Position */
#define MCLK_APBDMASK_SERCOM5_Msk             (_U_(0x1) << MCLK_APBDMASK_SERCOM5_Pos)              /**< (MCLK_APBDMASK) SERCOM5 APB Clock Enable Mask */
#define MCLK_APBDMASK_SERCOM5(value)          (MCLK_APBDMASK_SERCOM5_Msk & ((value) << MCLK_APBDMASK_SERCOM5_Pos))
#define MCLK_APBDMASK_TC4_Pos                 _U_(2)                                               /**< (MCLK_APBDMASK) TC4 APB Clock Enable Position */
#define MCLK_APBDMASK_TC4_Msk                 (_U_(0x1) << MCLK_APBDMASK_TC4_Pos)                  /**< (MCLK_APBDMASK) TC4 APB Clock Enable Mask */
#define MCLK_APBDMASK_TC4(value)              (MCLK_APBDMASK_TC4_Msk & ((value) << MCLK_APBDMASK_TC4_Pos))
#define MCLK_APBDMASK_ADC_Pos                 _U_(3)                                               /**< (MCLK_APBDMASK) ADC APB Clock Enable Position */
#define MCLK_APBDMASK_ADC_Msk                 (_U_(0x1) << MCLK_APBDMASK_ADC_Pos)                  /**< (MCLK_APBDMASK) ADC APB Clock Enable Mask */
#define MCLK_APBDMASK_ADC(value)              (MCLK_APBDMASK_ADC_Msk & ((value) << MCLK_APBDMASK_ADC_Pos))
#define MCLK_APBDMASK_AC_Pos                  _U_(4)                                               /**< (MCLK_APBDMASK) AC APB Clock Enable Position */
#define MCLK_APBDMASK_AC_Msk                  (_U_(0x1) << MCLK_APBDMASK_AC_Pos)                   /**< (MCLK_APBDMASK) AC APB Clock Enable Mask */
#define MCLK_APBDMASK_AC(value)               (MCLK_APBDMASK_AC_Msk & ((value) << MCLK_APBDMASK_AC_Pos))
#define MCLK_APBDMASK_PTC_Pos                 _U_(5)                                               /**< (MCLK_APBDMASK) PTC APB Clock Enable Position */
#define MCLK_APBDMASK_PTC_Msk                 (_U_(0x1) << MCLK_APBDMASK_PTC_Pos)                  /**< (MCLK_APBDMASK) PTC APB Clock Enable Mask */
#define MCLK_APBDMASK_PTC(value)              (MCLK_APBDMASK_PTC_Msk & ((value) << MCLK_APBDMASK_PTC_Pos))
#define MCLK_APBDMASK_OPAMP_Pos               _U_(6)                                               /**< (MCLK_APBDMASK) OPAMP APB Clock Enable Position */
#define MCLK_APBDMASK_OPAMP_Msk               (_U_(0x1) << MCLK_APBDMASK_OPAMP_Pos)                /**< (MCLK_APBDMASK) OPAMP APB Clock Enable Mask */
#define MCLK_APBDMASK_OPAMP(value)            (MCLK_APBDMASK_OPAMP_Msk & ((value) << MCLK_APBDMASK_OPAMP_Pos))
#define MCLK_APBDMASK_CCL_Pos                 _U_(7)                                               /**< (MCLK_APBDMASK) CCL APB Clock Enable Position */
#define MCLK_APBDMASK_CCL_Msk                 (_U_(0x1) << MCLK_APBDMASK_CCL_Pos)                  /**< (MCLK_APBDMASK) CCL APB Clock Enable Mask */
#define MCLK_APBDMASK_CCL(value)              (MCLK_APBDMASK_CCL_Msk & ((value) << MCLK_APBDMASK_CCL_Pos))
#define MCLK_APBDMASK_Msk                     _U_(0x000000FF)                                      /**< (MCLK_APBDMASK) Register Mask  */

#define MCLK_APBDMASK_SERCOM_Pos              _U_(1)                                               /**< (MCLK_APBDMASK Position) SERCOM5 APB Clock Enable */
#define MCLK_APBDMASK_SERCOM_Msk              (_U_(0x1) << MCLK_APBDMASK_SERCOM_Pos)               /**< (MCLK_APBDMASK Mask) SERCOM */
#define MCLK_APBDMASK_SERCOM(value)           (MCLK_APBDMASK_SERCOM_Msk & ((value) << MCLK_APBDMASK_SERCOM_Pos)) 
#define MCLK_APBDMASK_TC_Pos                  _U_(2)                                               /**< (MCLK_APBDMASK Position) TC4 APB Clock Enable */
#define MCLK_APBDMASK_TC_Msk                  (_U_(0x1) << MCLK_APBDMASK_TC_Pos)                   /**< (MCLK_APBDMASK Mask) TC */
#define MCLK_APBDMASK_TC(value)               (MCLK_APBDMASK_TC_Msk & ((value) << MCLK_APBDMASK_TC_Pos)) 

/* -------- MCLK_APBEMASK : (MCLK Offset: 0x24) (R/W 32) APBE Mask -------- */
#define MCLK_APBEMASK_RESETVALUE              _U_(0x0D)                                            /**<  (MCLK_APBEMASK) APBE Mask  Reset Value */

#define MCLK_APBEMASK_PAC_Pos                 _U_(0)                                               /**< (MCLK_APBEMASK) PAC APB Clock Enable Position */
#define MCLK_APBEMASK_PAC_Msk                 (_U_(0x1) << MCLK_APBEMASK_PAC_Pos)                  /**< (MCLK_APBEMASK) PAC APB Clock Enable Mask */
#define MCLK_APBEMASK_PAC(value)              (MCLK_APBEMASK_PAC_Msk & ((value) << MCLK_APBEMASK_PAC_Pos))
#define MCLK_APBEMASK_Msk                     _U_(0x00000001)                                      /**< (MCLK_APBEMASK) Register Mask  */


/** \brief MCLK register offsets definitions */
#define MCLK_CTRLA_REG_OFST            (0x00)              /**< (MCLK_CTRLA) Control A Offset */
#define MCLK_INTENCLR_REG_OFST         (0x01)              /**< (MCLK_INTENCLR) Interrupt Enable Clear Offset */
#define MCLK_INTENSET_REG_OFST         (0x02)              /**< (MCLK_INTENSET) Interrupt Enable Set Offset */
#define MCLK_INTFLAG_REG_OFST          (0x03)              /**< (MCLK_INTFLAG) Interrupt Flag Status and Clear Offset */
#define MCLK_CPUDIV_REG_OFST           (0x04)              /**< (MCLK_CPUDIV) CPU Clock Division Offset */
#define MCLK_LPDIV_REG_OFST            (0x05)              /**< (MCLK_LPDIV) Low-Power Clock Division Offset */
#define MCLK_BUPDIV_REG_OFST           (0x06)              /**< (MCLK_BUPDIV) Backup Clock Division Offset */
#define MCLK_AHBMASK_REG_OFST          (0x10)              /**< (MCLK_AHBMASK) AHB Mask Offset */
#define MCLK_APBAMASK_REG_OFST         (0x14)              /**< (MCLK_APBAMASK) APBA Mask Offset */
#define MCLK_APBBMASK_REG_OFST         (0x18)              /**< (MCLK_APBBMASK) APBB Mask Offset */
#define MCLK_APBCMASK_REG_OFST         (0x1C)              /**< (MCLK_APBCMASK) APBC Mask Offset */
#define MCLK_APBDMASK_REG_OFST         (0x20)              /**< (MCLK_APBDMASK) APBD Mask Offset */
#define MCLK_APBEMASK_REG_OFST         (0x24)              /**< (MCLK_APBEMASK) APBE Mask Offset */

